In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("/content/weather_10.csv")
df

       date      city  temperature  humidity
0  05-01-17  new york           65        56
1  05-02-17  new york           66        58
2  05-03-17  new york           68        60
3  05-01-17    mumbai           75        80
4  05-02-17    mumbai           78        83
5  05-03-17    mumbai           82        85
6  05-01-17   beijing           80        26
7  05-02-17   beijing           77        30
8  05-03-17   beijing           79        35

In [2]:
df.pivot(index='city',columns='date')

         temperature                   humidity
date        05-01-17 05-02-17 05-03-17 05-01-17 05-02-17 05-03-17
city
beijing           80       77       79       26       30       35
mumbai            75       78       82       80       83       85
new york          65       66       68       56       58       60

In [3]:
df.pivot(index='city',columns='date',values="humidity")

date      05-01-17  05-02-17  05-03-17
city
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

In [4]:
df.pivot(index='date',columns='city')

         temperature                 humidity
city         beijing mumbai new york  beijing mumbai new york
date
05-01-17          80     75       65       26     80       56
05-02-17          77     78       66       30     83       58
05-03-17          79     82       68       35     85       60

In [5]:
df.pivot(index='humidity',columns='city')

              date                     temperature
city       beijing    mumbai  new york     beijing mumbai new york
humidity
26        05-01-17       NaN       NaN        80.0    NaN      NaN
30        05-02-17       NaN       NaN        77.0    NaN      NaN
35        05-03-17       NaN       NaN        79.0    NaN      NaN
56             NaN       NaN  05-01-17         NaN    NaN     65.0
58             NaN       NaN  05-02-17         NaN    NaN     66.0
60             NaN       NaN  05-03-17         NaN    NaN     68.0
80             NaN  05-01-17       NaN         NaN   75.0      NaN
83             NaN  05-02-17       NaN         NaN   78.0      NaN
85             NaN  05-03-17       NaN         NaN   82.0      NaN

In [7]:
df = pd.read_csv("/content/weather_10_2.csv")
df

       date      city  temperature  humidity
0  05-01-17  new york           65        56
1  05-01-17  new york           61        54
2  05-02-17  new york           70        60
3  05-02-17  new york           72        62
4  05-01-17    mumbai           75        80
5  05-01-17    mumbai           78        83
6  05-02-17    mumbai           82        85
7  05-02-17    mumbai           80        26

In [8]:
df.pivot_table(index="city",columns="date")

         humidity          temperature
date     05-01-17 05-02-17    05-01-17 05-02-17
city
mumbai       81.5     55.5        76.5     81.0
new york     55.0     61.0        63.0     71.0

In [9]:
df.pivot_table(index="city",columns="date", margins=True,aggfunc=np.sum)

         humidity               temperature
date     05-01-17 05-02-17  All    05-01-17 05-02-17  All
city
mumbai        163      111  274         153      162  315
new york      110      122  232         126      142  268
All           273      233  506         279      304  583

In [11]:
df = pd.read_csv("/content/weather_10_3.csv")
df

       date      city  temperature  humidity
0  05-01-17  new york           65        56
1  05-02-17  new york           61        54
2  05-03-17  new york           70        60
3  12-01-17  new york           30        50
4  12-02-17  new york           28        52
5  12-03-17  new york           25        51

In [12]:
df['date'] = pd.to_datetime(df['date'])

In [13]:
df.pivot_table(index=pd.Grouper(freq='M',key='date'),columns='city')

             humidity temperature
city         new york    new york
date
2017-05-31  56.666667   65.333333
2017-12-31  51.000000   27.666667